var local_database =
  [
    {
      "date": "Sep 18 2017",
      "author": "大诗人",
      "title": "致橡树",
      "imgSrc": "/images/post/sls.jpg",
      headImgSrc: "/images/post/sls.jpg",
      "content": "我如果爱你，绝不像攀岩的凌霄花，借你的高枝炫耀自己。我如果爱你，绝不学痴情的鸟儿，为绿叶重复单调的歌曲。",
      detail: "《致橡树》\n我如果爱你——\n绝不像攀援的凌霄花，\n借你的高枝炫耀自己：\n我如果爱你——\n绝不学痴情的鸟儿，\n为绿荫重复单调的歌曲；\n也不止像泉源，\n+常年送来清凉的慰籍；\n也不止像险峰，增加你的高度，衬托你的威仪。\n甚至日光。\n甚至春雨。\n不，这些都还不够！\n我必须是你近旁的一株木棉，\n做为树的形象和你站在一起。\n根，紧握在地下，\n叶，相触在云里。\n每一阵风过，我们都互相致意，\n但没有人\n听懂我们的言语。\n你有你的铜枝铁干，\n像刀，像剑，\n也像戟，\n我有我的红硕花朵，\n\n像沉重的叹息，\n又像英勇的火炬，\n我们分担寒潮、风雷、霹雳；\n我们共享雾霭流岚、虹霓，\n仿佛永远分离，\n却又终身相依，\n这才是伟大的爱情，\n坚贞就在这里：\n不仅爱你伟岸的身躯，\n也爱你坚持的位置，脚下的土地",
      "reading": 112,
      "collection": 88,
      dateTime: "三天前",
      "avatar": "/images/avatar/1.png",
      postId: 0,
      music: {
        url: "http://ws.stream.qqmusic.qq.com/C100004HLusI2lLjZy.m4a?fromtag=38",
        title: "女儿情-万晓利",
        coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000004Wv5BO30pPc0.jpg?max_age=2592000"
      }
    },
    {
      "date": "Nov 28 2017",
      "author": "大魔王",
      "title": "铂金和王者的差距在哪里？",
      "imgSrc": "/images/post/wz.png",
      "headImgSrc": "/images/post/wz.png",
      "content": "一个信号就能叫齐足够多队友,各个位置分工明确,极少死亡,这是王者局常有的事 ...王者荣耀:王者荣耀越来越受欢迎,lol会被农药超越吗?",
      detail: "今天，《王者荣耀》KPL总决赛在深圳“春茧”体育馆正式召开。在赛事开始前的几个小时，场馆门外已经被游戏的各种粉丝堵得水泄不通，可见大家对游戏的热爱。到了下午三点，粉丝们早早将比赛现场坐满，灯光一黑，随着李荣浩亲临现场演唱《李白》，点燃了赛事的开场。随后随着粉丝的欢呼，知名演员李易峰，乒乓球选手张继科，著名演员欧豪以及百米飞人苏炳添来到舞台上，再次引来观众们阵阵尖叫。双方各分两队，分别由李易峰以及张继科带队，围观中上演了一场精彩绝伦的明星赛。明星赛现场，张继科的亚瑟肉的不能直视，但是李易峰的鲁班一直在后排猥琐张继科团队，最终夺冠。随后经过一段的介绍，KPL总决赛即将打响。",
      "reading": 324,
      "collection": 222,
      dateTime: "三天前",
      "avatar": "/images/avatar/2.png",
      postId: 1,
      music: {
        url: "http://ws.stream.qqmusic.qq.com/C100004HLusI2lLjZy.m4a?fromtag=38",
        title: "女儿情-万晓利",
        coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000004Wv5BO30pPc0.jpg?max_age=2592000"
      }
    },
    {
      "date": "Nov 29 2017",
      "author": "爆肝玩家zz",
      "title": "那些年让你恨之入骨的怪物，复活币收费站",
      "imgSrc": "/images/post/lr.png",
      "headImgSrc": "/images/post/lr.png",
      "content": "dnf前期版本，副本是很难刷的，30+的人来带僵尸，烈焰格拉卡都是很正常的。几乎每个地图都会有人带，下面让我们来回忆一下，有哪些怪物让你一定交了复活币",
      detail: "一、毒猫王\n这是猛毒雷鸣废墟的BOSS，雷鸣废墟的落雷凯诺都弱爆了好吗，这个怪物的难打之处就在于毒性极其猛烈。不光怪物本身有毒性，地上还有剧毒沼泽，对于一个几级的小号来讲，沾上就是掉血掉到底。加之本身是个猫妖，如果不小心被咬到，也是只有被直接咬死这一个结果。\n\n二、烈焰彼诺修\n\n烈焰格拉卡可是说是很多玩家的噩梦了，天上的火陨石不断砸，根本没有几个地方可以躲，小号的皮又脆，炸一下就是半管血。如果是近身职业，会出现更为尴尬的情况，你刚走到她身边，她就会挥舞他的魔法杖，你就biu地一下被弹开了。当你躺在地上的时候，陨石就下来了，复活币就没有了。早一些的时候角色转职就是需要刷这个图的，想想就觉得可怕。\n\n三、盗尸者骨狱息\n\n15W带僵尸了，骗子死!每天僵尸图的门口都有一大群人在刷着这句话。DNF早起的时候，这个图基本是没有人可以单过的，尽管它只是一个10多级的副本，很多30几级的玩家都不敢掉以轻心，一个不小心就会被直接带走。这个怪物最恶心的地方就是冰冻和咬住就不放这两个地方，如果不小心被它冰住了，就是一口咬到死的结果。\n\n四、罪恶之眼\n\n悬空城的领主，相信很多人在这里不止死过一次。它发射出来的激光只要被击中，基本就是残血了，加上地上还有眼睛也会发射激光，分分钟教你做人。而且它还有保护机制，如果你靠近进行攻击，会biu地一下把你弹开，非常恶心。悬空城这个图的绿名也都是非常蛋疼的，红色的骑士阿克雷会命令突击骑士一起进攻，一个不注意就被秒杀。还有个需要跳起来打的哥布林和冰火两姐妹，悬空城处处是危险。\n\n五、光之城主赛格哈特\n\n说到这个BOSS，我都止不住泪流满面。全屏的闪电攻击，只有被秒杀的份，小号根本扛不住他的攻击。另外他的近身攻击也很强，虽然只是简单的甩一下头发，但是他在周围形成的小范围光圈攻击也是直接让你半血的技能。在升级路上，这里无疑是我交复活币次数最多的地方。\n\n六、长脚罗斯特第二脊椎的BOSS，虽然他本身不会移动，但是他会利用他的长脚来刺你，攻击距离非常远，起码有大半个屏幕。还会从天花板伸下他的大长腿，对你造成刺击伤害或者直接卷住你造成持续性伤害，这些都是非常恶心的技能。远程攻击的职业会更容易攻击他，比如枪炮，站得远远地用喷火器和激光炮打消耗。就算在现在的版本，天帷巨兽的罗斯特也是比较难的图，只能一点一点磨。\n\n七、邪龙斯皮兹头部\n\n说到这个怪物，真的是小号噩梦。不光只有领主，这整个图都是非常恶心的，各种骷髅怪物和灵魂怪物，小号根本应付不过来。这还没完，天上还会掉落陨石进行攻击，让你应接不暇，一个不小心被陨石砸到，怪物救一哄而上。说回BOSS，他会发射铁链进行攻击，还会喷吐毒雾，被铁链命中或者沾上毒雾，基本你的血量就见底了，稍微不注意就是直接被秒杀。\n\n 八、影子剑士刹影\n\n这是早起版本DNF最难缠的BOSS之一，用现在的话说就是，厉害了我的哥!进到房间里面他就会无限放阵，你根本不能接近，且不说阵的伤害本身就很高，只要你接近他的攻击范围，鬼影闪直接教你做人。另外他还有鬼影步和墓碑，他的墓碑像是不要钱似的一通乱砸，只要被命中基本都是只有交复活币这一种结果。\n\n九、无头骑士\n\n暗黑城入口的BOSS，不浮空不倒地，高硬直恢复，你可以理解成全程霸体。他主要特色是移动速度贼快，而且是超喜欢跑，特别是到HP比较少后满地图狂奔回血。没有人敢跟他正面硬刚，只能通过走位抓他的技能空隙进行攻击，他的冲撞和大剑的扇形攻击都是会直接让你交复活币的技能。\n\n十、疯癫的莉莉\n\n利库天井一图的绿名怪物，虽然不是领主，却比大多数领主更恶心，相信死在她手上的冒险家不计其数。我早先是分不清楚她是什么职业的，因为她会用烈焰冲击直接秒杀你，也会用流行闪影击让你一跪不起。面对她只能慢慢消耗，不能被她抓住，一被抓就可以宣布死亡。\n\n十一、冰龙斯卡萨\n\n这个厉害了，60版本的终极BOSS，会捶地会全屏冰冻，在它面前没有谁敢嬉皮笑脸。而且能攻击到他的时间非常短，基本只有几秒钟，错过了这几秒，你将迎来的就是全屏冰冻效果和庞大的爪子。只要你被冻住，就基本宣布GG了，伤害奇高而且持续时间较长。做主线任务做到这个图，都是需要让大神带才能过。",
      "reading": 168,
      "collection": 124,
      dateTime: "五天前",
      "avatar": "/images/avatar/3.png",
      postId: 2,
      music: {
        url: "http://ws.stream.qqmusic.qq.com/C100004HLusI2lLjZy.m4a?fromtag=38",
        title: "女儿情-万晓利",
        coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000004Wv5BO30pPc0.jpg?max_age=2592000"
      }
    },
    {
      //按住alt + shift + F 可以格式化代码样式
      title: "当我们在谈论经济学时，我们在谈论什么?",
      content: "引言在我跟学生课后交流时，以及我在知乎上阅读有关“经济”问题的论题时，经常会遇到这样的情况：...",
      detail: "1 引言\n\n在我跟学生课后交流时，以及我在知乎上阅读有关“经济”问题的论题时，经常会遇到这样的情况：有些人套用“经济理论“的知识去解释现实中发生的经济事件，结果发现很多事情讲不通，或者发现”理论告诉我们的“与现实发生的是相反的。也有学生经常跟我说：经济学有什么用？为了说明这个，我经常从两个方面来进行解释，尝试用我个人所擅长的解决问题的视角和他们能够听懂的方法来说明经济学是什么，它的作用边界在哪里：\r\n\n2 ”简笔素描“与”油画肖像“我们给人画肖像画，可以用简笔素描，也可以用油画肖像。油画肖像可以在最大程度上保存了人物的各方面的细节和特点，而简笔素描则忽略了很多细节。尽管简笔素描忽略了人物的许多细节，但我们仍旧能够很容易的认出画中的人物是谁。为什么？因为这种方法保留了人物最显著的特征，以至于我们可以忽略其次要特征而对人物做出判定。\n\n2.1 ”简笔素描“对于绝大多数的非经济学专业大众而言（经济学相关专业硕士学历以上），人们所接触到的经济学都是初级微观经济学。所谓的初级微观经济学，对于经济问题的”画法“就是一种”简笔素描“。比如初级微观经济学教材中广为使用的这种一元一次需求函数：y=bx+a，需求量的唯一变量是产品价格。但仅凭直觉我们就可以断言，现实中影响需求量的因素绝不止价格这一种，因此我们可以认为这个模型对经济问题的描述是失真的。然而但这种失真却是必要的和有意义的，其意义在与它利于揭示价格对于需求的影响，而不在于否定影响需求的其他因素——",
      imgSrc: "/images/post/sls.jpg",
      headImgSrc: "/images/post/sls.jpg",
      reading: 62,
      collection: 92,
      author: "知乎",
      date: "Nov 12 2016",
      dateTime: "三天前",
      avatar: "/images/avatar/3.png",
      postId: 3,
      music: {
        url: "http://ws.stream.qqmusic.qq.com/C100004HLusI2lLjZy.m4a?fromtag=38",
        title: "女儿情-万晓利",
        coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000004Wv5BO30pPc0.jpg?max_age=2592000"
      }
    },
    {
      title: "微信·小程序开发工具安装指南",
      content: "这两天闲来无事，也安装了 “微信折叠”的开发工具来玩一下。以下是一些小道消息及使用体验，过两天我会写一篇文章以开发者的角度来详细评价微信小程序",
      imgSrc: "/images/post/xiaolong.jpg",
      reading: 102,
      detail: "这两天闲来无事，也安装了 “微信折叠”的开发工具来玩一下。以下是一些小道消息及使用体验，过两天我会写一篇文章以开发者的角度来详细评价微信小程序:微信小程序不能开发游戏类、直播类功能，小程序每个人关注的上限是20个（还不确定，不过我相信这是真的，这次公布的API里并没有视频组件。微信太大，苹果要有所顾忌，但是微信也要做出相应的让步)微信目前有没有同苹果商谈好，还是个未知数，毕竟会对AppStore有一定的冲击。抛弃了大量的javascript组件后，这个生态体系变得相当的封闭，微信解释肯定是：为了更好的性能提升。那么我们拭目以待。小程序的入口是微信里的三级菜单，就是在“Tab栏发现里的游戏下面加入一个“小程序”。反正，这一栏里的购物和游戏我是从来没点进去过的。以腾讯的尿性，小程序同服务号一样，其关系链及重要功能的开放程度会因“人”而异。对，优质的接口只会开放给腾讯的儿子们（滴滴呀、京东呀）",
      collection: 92,
      dateTime: "24小时前",
      headImgSrc: "/images/post/xiaolong.jpg",
      author: "猫是猫的猫",
      date: "Nov 20 2016",
      avatar: "/images/avatar/5.png",
      postId: 4,
      music: {
        url: "http://ws.stream.qqmusic.qq.com/C100002mWVx72p8Ugp.m4a?fromtag=38",
        title: "恋恋风尘-老狼",
        coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000001VaXQX1Z1Imq.jpg?max_age=2592000",
      }
    },
    {
      title: "从视觉到触觉 这款VR手套能给你真实触感",
      content: "8月29日消息，据国外媒体VentureBeat报道，一家名为Dexta Robotics的公司最近发布了一款有望变革虚拟现实手部追踪与交互方式的新产品",
      imgSrc: "/images/post/vr.png",
      reading: 102,
      detail: "消息，据国外媒体VentureBeat报道，一家名为Dexta Robotics的公司最近发布了一款有望变革虚拟现实手部追踪与交互方式的新产品。该产品名为“Dexmo”，它是一款像手套那样戴在手上使用的未来主义外骨骼。它内置大量的元件，能够与VR体验进行交互，可帮助你感觉握在你的双手的虚拟物体。Dexmo据Dexta称，“Dexmo是一款针对你的双手的机械外骨骼。它能够捕捉你的手部运动，以及提供即时的力反馈。有了Dexmo，你可以感受到虚拟物体的大小、形状和坚硬度。你可以接触数字世界。”市面上已经有数款产品旨在处理虚拟现实中的手部交互，也有相关的产品即将要进入市场。例如，颇受欢迎的HTC Vive头盔配有一副控制器，其控制器能够使得追踪系统看到你的双手，让你可以用它们来在特定体验中与物体进行交互。今年晚些时候，Oculus将开始出货类似的手部控制产品Oculus Touch。10月，索尼也将开始出货配备两个PlayStation Move手部控制器的PS VR。Leap Motion甚至更进一步：利用传感器来追踪手指和手部的运动。",
      collection: 26,
      dateTime: "24小时前",
      headImgSrc: "/images/post/vr.png",
      author: "深白色",
      date: "Nov 20 2016",
      avatar: "../../../images/avatar/3.png",
      postId: 5,
      music: {
        url: "http://ws.stream.qqmusic.qq.com/C100000Zn0vS4fKKo8.m4a?fromtag=38",
        title: "沉默是金-张国荣",
        coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000003at0mJ2YrR2H.jpg?max_age=2592000"
      }
    },
    {
      title: "爱奇艺创维开展战略合作，合力布局开放娱乐生态",
      content: "爱奇艺和创维分别作为国内领先的在线视频品牌",
      imgSrc: "/images/iqiyi.png",
      reading: 96,
      detail: "爱奇艺和创维分别作为国内领先的在线视频品牌和家电品牌。双方一直锐意创新，为用户提供优质的服务体验和产品体验。据悉，爱奇艺与创维将展开从资本到VIP会员服务等各方面的深入合作。籍由此次合作，爱奇艺将战略投资创维旗下拥有高端互联网电视品牌的酷开公司。从下一财年开始，创维旗下互联网电视将通过银河互联网电视集成播控平台，预置VIP会员服务及相关内容。这种捆绑终端与VIP内容的全新销售模式，将大幅提升互联网电视终端用户的体验，给予用户更多优质内容的选择。",
      collection: 26,
      dateTime: "21小时前",
      headImgSrc: "/images/iqiyi.png",
      author: "深白色",
      date: "Nov 20 2016",
      avatar: "../../../images/avatar/5.png",
      postId: 6,
      music: {
        url: "http://ws.stream.qqmusic.qq.com/C100002I8eGJ28BI17.m4a?fromtag=38",
        title: "朋友-谭咏麟",
        coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000004eGsCN3SUheO.jpg?max_age=2592000"
      }
    },
  ]

module.exports = {
  postList: local_database
}